In [1]:
%load_ext sql
%sql mysql://root:password@localhost/pizza_project

In [2]:
%%sql
RENAME TABLE `Order` TO `orders`;
RENAME TABLE `Customer` TO `customers`;

 * mysql://root:***@localhost/pizza_project
(MySQLdb.OperationalError) (1050, "Table 'orders' already exists")
[SQL: RENAME TABLE `Order` TO `orders`;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [3]:
%%sql

SHOW TABLES;

 * mysql://root:***@localhost/pizza_project
15 rows affected.

[('customerdiscount',),
 ('customers',),
 ('delivery',),
 ('delivery_persons',),
 ('deliveryperson',),
 ('dessert',),
 ('discountcode',),
 ('drink',),
 ('earningsreport',),
 ('ingredient',),
 ('order_items',),
 ('orderitem',),
 ('orders',),
 ('pizza',),
 ('pizzaingredient',)]

In [4]:
%%sql
SELECT * FROM Pizza;

 * mysql://root:***@localhost/pizza_project
10 rows affected.

[(1, 'Margherita', 'Tomato, cheese, basil', Decimal('4.00'), 1, 0),
 (2, 'Pepperoni', 'Tomato, cheese, pepperoni', Decimal('5.00'), 0, 0),
 (3, 'Vegetarian', 'Tomato, cheese, mushrooms, olives, pineapple, tomato, onion, garlic, basil, oregano', Decimal('8.75'), 1, 0),
 (4, 'Hawaiian', 'Tomato, cheese, ham, pineapple', Decimal('4.75'), 0, 0),
 (5, 'Meat Feast', 'Tomato, cheese, pepperoni, ham, chicken, beef', Decimal('7.00'), 0, 0),
 (6, 'Vegan', 'Tomato, vegan cheese, mushrooms, olives, pineapple, tomato, onion, garlic, basil, oregano', Decimal('8.75'), 1, 0),
 (7, 'Spicy', 'Tomato, cheese, pepperoni, chilli flakes, pepper', Decimal('5.00'), 0, 0),
 (8, 'Cheese Feast', 'Tomato, cheese, vegan cheese', Decimal('4.00'), 1, 0),
 (9, 'Dessert', 'Nutella, banana, strawberry', Decimal('4.25'), 1, 0),
 (10, 'Fruity', 'Tomato, cheese, pineapple, banana, strawberry', Decimal('5.25'), 1, 0)]

In [5]:
%%sql
SELECT * FROM Dessert;
DESC Dessert;

 * mysql://root:***@localhost/pizza_project
5 rows affected.
3 rows affected.

[('DessertID', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('Name', 'varchar(255)', 'YES', '', None, ''),
 ('Price', 'decimal(10,2)', 'YES', '', None, '')]

In [6]:
%%sql
SELECT * FROM Ingredient LIMIT 5;

 * mysql://root:***@localhost/pizza_project
5 rows affected.

[(1, 'Base', Decimal('2.00'), 1, 1),
 (2, 'Cheese', Decimal('0.50'), 1, 0),
 (3, 'Sauce', Decimal('0.50'), 1, 1),
 (4, 'Pepperoni', Decimal('1.00'), 0, 0),
 (5, 'Mushrooms', Decimal('0.75'), 1, 1)]

In [7]:
%%sql

SELECT * FROM customers;

 * mysql://root:***@localhost/pizza_project
4 rows affected.

[(1, 'Test User', None, None, None, None, 'testuser', 'ef92b778bafe771e89245b89ecbc08a44a4e166c06659911881f383d4473e94f', 0, 'customer', None),
 (2, '321', None, None, None, None, '32', '865736a1c30a82dc67aba820360a01b1d9d0da5643234cd07c4d60b06eb530c5', 0, 'customer', None),
 (3, '123', None, None, None, None, '123', 'a665a45920422f9d417e4867efdc4fb8a04a1f3fff1fa07e998e86f7f7a27ae3', 0, 'customer', None),
 (4, '12313', None, None, None, None, '123123', '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', 0, 'customer', None)]

In [8]:
%%sql

SELECT * FROM order_items;

 * mysql://root:***@localhost/pizza_project
6 rows affected.

[(1, 1, 'PIZZA', 5, 1, Decimal('7.00')),
 (2, 2, 'PIZZA', 2, 2, Decimal('10.00')),
 (3, 3, 'PIZZA', 1, 1, Decimal('4.00')),
 (4, 3, 'PIZZA', 7, 2, Decimal('10.00')),
 (5, 3, 'DRINK', 2, 2, Decimal('3.98')),
 (6, 3, 'DESSERT', 2, 1, Decimal('3.50'))]

In [9]:
%%sql

SELECT * FROM orders;

 * mysql://root:***@localhost/pizza_project
3 rows affected.

[(1, 3, None, 'Pending', None, Decimal('7.00'), 0, None),
 (2, 3, None, 'Pending', None, Decimal('10.00'), 0, None),
 (3, 3, None, 'Pending', None, Decimal('21.48'), 0, None)]

In [10]:
%%sql
SHOW CREATE TABLE orders;

 * mysql://root:***@localhost/pizza_project
1 rows affected.

[('orders', 'CREATE TABLE `orders` (\n  `OrderID` int NOT NULL AUTO_INCREMENT,\n  `CustomerID` int DEFAULT NULL,\n  `OrderDate` timestamp NULL DEFAULT NULL,\n  `O ... (480 characters truncated) ... iveryPersonID`) REFERENCES `deliveryperson` (`DeliveryPersonID`)\n) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci')]